/* Особенности JavaScript. */
// (Здесь кратко повторяется пройденный материал первой подготовительной главы, вводящей в курс изучения языка JavaScript.)
// Это значит, что я уже могу пойти сдавать ЕГЭ на скриптыче))

// Всё писать не буду за ненадобностью...

// 1) Структура кода:

/*
// 1. Инструкции разделяются точкой с запятой:
alert("Привет"); alert('Мир');

// 2. Перевод строки тоже интепретируется как разделитель:
alert("Привет")
alert('Мир')

*/

// 3. Во 2-ом примере показана автоматическая вставка, она не всегда срабатывает:

alert("После этого сообщения ждите ошибку."); // если убрать ';', то будет ошибкa.

[4, 5].forEach(alert);


// 2) Переменные:

// Переменные типизируются динамически:

let x = 5;
x = "Вася";


// Короткий получился документ, но теперь я знаю основы JavaScript)) Дальше -- БОЛЬШЕ! Ведь это был первый шаг, а за ним должен следовать следующий.






